//AJAX, сетевые API fetch, promise
//BOM коротко
// события два метода назначения обработчика, всплытие и погружение, параметры события объект event
///шаблоны в DOM
//создание объетов в DOM 
//получение элементов DOM и доступ к атрибутам в HTML 5
// DOM методы работы с DOM
//строки методы работы со строками, слайсы
//массивы методы массивов (деструктуризация, rest и спред оператор)
//Объекты создание и работа с объектами, методы объектов, деструктуризация, копирование обектов
//замыкания
//функции область видимости, функции как объект, поднятие определения, контекст, стрелочные фунции, параметры функции, arguments
//Переменные const var let их отличие поднятие определения